# FObject

## Description
Function FObject returns a handle to the first object in the first layer of the active document. If the document is empty, the function returns NIL.

```pascal
FUNCTION FObject : HANDLE;
```

```python
def vs.FObject():
    return HANDLE
```

## Examples
TraverseObjects

```pascal
resultH := FObject;
```
```python
import vs

# Function FObject returns a handle to the first object in the first layer of
# the active document.
objHandle = vs.FObject()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```
See also in tutorials: 10. Iterate the Drawing and Report a Summary

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling